Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоСубсидиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоСубсидиям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостояниеРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРеструктуризацииДолга</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРеструктуризации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорРеструктуризацииДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлатежиПоРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлатежиПоРеструктуризацииДолга</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыРеструктуризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыРеструктуризации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнут</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидЗадолженностиДляБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидЗадолженностиДляБухгалтерии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебеторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыКонтрагентовДляБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентовДляБухгалтерии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДоговорРеструктуризацииДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлатежиПоРеструктуризацииДолга</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговораРеструктуризацииДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакрытиеМесяца/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗакрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание
		|				И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|				И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|				И МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК РасчетыПоЛицевымСчетамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание
		|				И Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|				И МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК РасчетыПоЛицевымСчетамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
		|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание
		|				И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|				И ВЫБОР
		|					КОГДА Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|						ТОГДА МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ИНАЧЕ МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				КОНЕЦ
		|				И НЕ Услуга.НеВключатьВРаспределение) КАК РасчетыПоЛицевымСчетамОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	МесяцНачисления,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга.ПолеСортировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.Регистратор,
		|	РасчетыПоЛицевымСчетам.Организация,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.Услуга,
		|	РасчетыПоЛицевымСчетам.Период,
		|	РасчетыПоЛицевымСчетам.Сумма,
		|	РасчетыПоЛицевымСчетам.ВидДвижения
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ДоговорРеструктуризацииДолга)
		|	И РасчетыПоЛицевымСчетам.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыПоСубсидиям.Организация,
		|	РасчетыПоСубсидиям.ЛицевойСчет,
		|	РасчетыПоСубсидиям.МесяцНачисления,
		|	РасчетыПоСубсидиям.Услуга,
		|	РасчетыПоСубсидиям.ГраницаСубсидии
		|ПОМЕСТИТЬ НачисленныеСубс
		|ИЗ
		|	РегистрНакопления.РасчетыПоСубсидиям КАК РасчетыПоСубсидиям
		|ГДЕ
		|	РасчетыПоСубсидиям.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|	И РасчетыПоСубсидиям.Организация = &Организация
		|	И РасчетыПоСубсидиям.ЛицевойСчет.Владелец = &Здание
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСубсидиям.Организация,
		|	РасчетыПоСубсидиям.ЛицевойСчет,
		|	РасчетыПоСубсидиям.Услуга,
		|	РасчетыПоСубсидиям.МесяцНачисления,
		|	РасчетыПоСубсидиям.ГраницаСубсидии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоСубсидиямОстатки.Организация,
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления КАК МесяцНачисления,
		|	СУММА(РасчетыПоСубсидиямОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	РасчетыПоСубсидиямОстатки.Услуга.ПолеСортировки КАК УслугаПолеСортировки,
		|	РасчетыПоСубсидиямОстатки.Услуга.ВидУслуги.ПолеСортировки КАК УслугаВидУслугиПолеСортировки,
		|	ЕСТЬNULL(НачисленныеСубс.ГраницаСубсидии, 0) КАК ГраницаСубсидии
		|ИЗ
		|	РегистрНакопления.РасчетыПоСубсидиям.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание
		|				И НАЧАЛОПЕРИОДА(МесяцНачисления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)) КАК РасчетыПоСубсидиямОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленныеСубс КАК НачисленныеСубс
		|		ПО РасчетыПоСубсидиямОстатки.Организация = НачисленныеСубс.Организация
		|			И РасчетыПоСубсидиямОстатки.ЛицевойСчет = НачисленныеСубс.ЛицевойСчет
		|			И РасчетыПоСубсидиямОстатки.Услуга = НачисленныеСубс.Услуга
		|			И РасчетыПоСубсидиямОстатки.МесяцНачисления = НачисленныеСубс.МесяцНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.Услуга.ВидУслуги.ПолеСортировки,
		|	РасчетыПоСубсидиямОстатки.Услуга.ПолеСортировки,
		|	РасчетыПоСубсидиямОстатки.Организация,
		|	ЕСТЬNULL(НачисленныеСубс.ГраницаСубсидии, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцНачисления,
		|	УслугаВидУслугиПолеСортировки,
		|	УслугаПолеСортировки";
		
		
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	Запрос.УстановитьПараметр("Дата", ДокументСсылкаЗакрытиеЛицевогоСчета.Дата);

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаАвансыУслуги = РезультатЗапроса[0].Выгрузить();
	ТаблицаАвансы = РезультатЗапроса[1].Выгрузить();
	ТаблицаДолги = РезультатЗапроса[2].Выгрузить();
	ТаблицаРеструктуризаций = РезультатЗапроса[3].Выгрузить();
	ТаблицаСубсидии =  РезультатЗапроса[5].Выгрузить();
	
	ТаблицаРасчетыПоЛицевымСчетам = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Период");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("МесяцНачисления");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Сумма");
	
	
	ТаблицаРасчетыПоСубсидиям = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Период");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("МесяцНачисления");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Сумма");
	
	
	Для Каждого СтрокаТаблицаАвансыУслуги Из ТаблицаАвансыУслуги Цикл	
		СуммаОсталосьРаспределить = -СтрокаТаблицаАвансыУслуги.СуммаОстаток;
		
		ВыборкаДолги = ТаблицаДолги.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга", СтрокаТаблицаАвансыУслуги.ЛицевойСчет, СтрокаТаблицаАвансыУслуги.Услуга));
		
		Для каждого СтрокаВыборки Из ВыборкаДолги Цикл
			
			Если СтрокаВыборки.СуммаОстаток <= 0 тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаВыборки.СуммаОстаток <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				
				Сумма = СтрокаВыборки.СуммаОстаток;
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - СтрокаВыборки.СуммаОстаток;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				Сумма =	СуммаОсталосьРаспределить;
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
			НоваяСтрока.Сумма = Сумма;
			
			НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
			НоваяСтрока.МесяцНачисления = '00010101';
			НоваяСтрока.Сумма = -Сумма;
			
			СтрокаВыборки.СуммаОстаток = СтрокаВыборки.СуммаОстаток - Сумма;
			
			Если СуммаОсталосьРаспределить = 0 Тогда
				Прервать;  //метка
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла;		
	
	
	Для Каждого СтрокаТаблицаАвансы Из ТаблицаАвансы Цикл	
		СуммаОсталосьРаспределить = -СтрокаТаблицаАвансы.СуммаОстаток;
		
		ВыборкаДолги = ТаблицаДолги.НайтиСтроки(Новый Структура("ЛицевойСчет", СтрокаТаблицаАвансы.ЛицевойСчет));
		
		Для каждого СтрокаВыборки Из ВыборкаДолги Цикл
			
			Если СтрокаВыборки.СуммаОстаток <= 0 тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаВыборки.Услуга = Справочники.Услуги.РеструктуризацияДолга И СтрокаВыборки.СуммаОстаток >= СуммаОсталосьРаспределить тогда
				СтрокаПоиска = ТаблицаРеструктуризаций.НАйти(СтрокаВыборки.ЛицевойСчет, "ЛицевойСчет");
				Если СтрокаПоиска <> Неопределено ТОгда
					Продолжить;
				КонецЕсли;
			КонецЕсли;	
			
			
			
			Если СтрокаВыборки.СуммаОстаток <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				
				Сумма = СтрокаВыборки.СуммаОстаток;
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - СтрокаВыборки.СуммаОстаток;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				Сумма =	СуммаОсталосьРаспределить;
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			//КонецЕсли;	
			
			НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
			НоваяСтрока.Сумма = Сумма;
			
			НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
			НоваяСтрока.Услуга = Справочники.Услуги.ПустаяСсылка();
			НоваяСтрока.МесяцНачисления = '00010101';
			НоваяСтрока.Сумма = -Сумма;
			
			СтрокаВыборки.СуммаОстаток = СтрокаВыборки.СуммаОстаток - Сумма;
			
			Если СуммаОсталосьРаспределить = 0 Тогда
				Прервать;
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла;		
	
	////Метка Субсидии
	//Для Каждого СтрокаТаблицаСубсидииУслуги Из ТаблицаСубсидии Цикл	
	//	СуммаОсталосьРаспределить = СтрокаТаблицаСубсидииУслуги.СуммаОстаток;
	//	
	//	//+ HVOYA Довгань Ю.С. 27.07.2018 14:54:51                           
	//	Если  СтрокаТаблицаСубсидииУслуги.ЛицевойСчет.Наименование <> "1003" Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	//- HVOYA Довгань Ю.С. 27.07.2018 14:54:53
	//	
	//	ВыборкаДолги = ТаблицаДолги.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга, МесяцНачисления", СтрокаТаблицаСубсидииУслуги.ЛицевойСчет, СтрокаТаблицаСубсидииУслуги.Услуга,СтрокаТаблицаСубсидииУслуги.МесяцНачисления));
	//	
	//	Для каждого СтрокаВыборки Из ВыборкаДолги Цикл
	//		
	//		Если СтрокаВыборки.СуммаОстаток <= 0 тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если СтрокаВыборки.СуммаОстаток <= СтрокаТаблицаСубсидииУслуги.ГраницаСубсидии Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		
	//		Если СтрокаВыборки.СуммаОстаток <= СуммаОсталосьРаспределить  Тогда // сумма остатка меньше или равна чем осталось распределить
	//			
	//			Сумма = СтрокаВыборки.СуммаОстаток;
	//			СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - СтрокаВыборки.СуммаОстаток;
	//			
	//		Иначе // сумма остатка больше чем нужно распределить
	//			
	//			Сумма =	СуммаОсталосьРаспределить;
	//			СуммаОсталосьРаспределить = 0;
	//			
	//		КонецЕсли;
	//		
	//		НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
	//		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
	//		НоваяСтрока.Сумма = Сумма;
	//		
	//		НоваяСтрока = ТаблицаРасчетыПоСубсидиям.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
	//		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
	//		//НоваяСтрока.МесяцНачисления = '00010101';
	//		НоваяСтрока.Сумма = Сумма;
	//		
	//		СтрокаВыборки.СуммаОстаток = СтрокаВыборки.СуммаОстаток - Сумма;
	//		
	//		Если СуммаОсталосьРаспределить = 0 Тогда
	//			Прервать;  //метка
	//		КонецЕсли; 
	//	
	//	КонецЦикла; 
	//	
	//КонецЦикла;	
	
	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", ТаблицаРасчетыПоЛицевымСчетам);
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии", ТаблицаРасчетыПоСубсидиям);

	СформироватьТаблицуСтатусовРеструктуризации(ДокументСсылкаЗакрытиеЛицевогоСчета, СтруктураДополнительныеСвойства);


КонецПроцедуры

// Формує статуси реструктуризації (Просрочен/Действует) за результатом план-факт на дату закриття.
Процедура СформироватьТаблицуСтатусовРеструктуризации(ДокументСсылка, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Состояние.ЛицевойСчет КАК ЛицевойСчет,
		|	Состояние.Договор КАК Договор,
		|	Состояние.ДатаНачала КАК ДатаНачала,
		|	Состояние.ДатаОкончания КАК ДатаОкончания,
		|	ЕСТЬNULL(ПланТаб.СуммаПлан, 0) КАК План,
		|	ЕСТЬNULL(ФактТаб.СуммаРасход, 0) КАК Факт
		|ИЗ
		|	РегистрСведений.СостояниеРеструктуризацииДолга.СрезПоследних(
		|			&Дата,
		|			Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеструктуризации.Действует)
		|				И ЛицевойСчет.Владелец = &Здание) КАК Состояние
		|		ЛЕВОЕ СОЕДИНЕНИЕ (
		|			ВЫБРАТЬ
		|				Платежи.ЛицевойСчет КАК ЛицевойСчет,
		|				СУММА(Платежи.СуммаПлатежа) КАК СуммаПлан
		|			ИЗ
		|				РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК Платежи
		|			ГДЕ
		|				Платежи.Период <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			СГРУППИРОВАТЬ ПО
		|				Платежи.ЛицевойСчет) КАК ПланТаб
		|		ПО Состояние.ЛицевойСчет = ПланТаб.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(
		|				, КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ,
		|				Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК ФактТаб
		|		ПО Состояние.ЛицевойСчет = ФактТаб.ЛицевойСчет";
	Запрос.УстановитьПараметр("Дата", КонецДня(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("Здание", ДокументСсылка.Здание);

	Выборка = Запрос.Выполнить().Выгрузить();

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Период");
	Таблица.Колонки.Добавить("ЛицевойСчет");
	Таблица.Колонки.Добавить("Статус");
	Таблица.Колонки.Добавить("Договор");
	Таблица.Колонки.Добавить("ДатаНачала");
	Таблица.Колонки.Добавить("ДатаОкончания");

	Для Каждого Стр Из Выборка Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Период        = ДокументСсылка.Дата;
		НоваяСтрока.ЛицевойСчет   = Стр.ЛицевойСчет;
		НоваяСтрока.Договор       = Стр.Договор;
		НоваяСтрока.ДатаНачала    = Стр.ДатаНачала;
		НоваяСтрока.ДатаОкончания = Стр.ДатаОкончания;
		НоваяСтрока.Статус        = ?(Стр.Факт + 0.01 < Стр.План,
			Перечисления.СтатусыРеструктуризации.Просрочен,
			Перечисления.СтатусыРеструктуризации.Действует);
	КонецЦикла;

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостояниеРеструктуризации", Таблица);

КонецПроцедуры

Процедура СформироватьНачислениеДляБухгалтерии(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	УчетКоммунальныхУслуг.СформироватьНачислениеПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	
	ДатаДокумента = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата - 10;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменУчетВОСМДБухгалтерия.Ссылка,
	|	ОбменУчетВОСМДБухгалтерия.ДатаНачалаВыгрузкиДокументов
	|ИЗ
	|	ПланОбмена.ОбменУчетВОСМДБухгалтерия КАК ОбменУчетВОСМДБухгалтерия
	|ГДЕ
	|	ОбменУчетВОСМДБухгалтерия.ПометкаУдаления = ЛОЖЬ
	|	И ОбменУчетВОСМДБухгалтерия.ДатаНачалаВыгрузкиДокументов <= &ДатаНач
	|	И ОбменУчетВОСМДБухгалтерия.Ссылка <> &ЭтотУзел
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбменУчетВОСМДБухгалтерия20.Ссылка,
	|	ОбменУчетВОСМДБухгалтерия20.ДатаНачалаВыгрузкиДокументов
	|ИЗ
	|	ПланОбмена.ОбменУчетВОСМДБухгалтерия20 КАК ОбменУчетВОСМДБухгалтерия20
	|ГДЕ
	|	ОбменУчетВОСМДБухгалтерия20.ПометкаУдаления = ЛОЖЬ
	|	И ОбменУчетВОСМДБухгалтерия20.ДатаНачалаВыгрузкиДокументов <= &ДатаНач
	|	И ОбменУчетВОСМДБухгалтерия20.Ссылка <> &ЭтотУзел20";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаДокумента);
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменУчетВОСМДБухгалтерия.ЭтотУзел());
	Запрос.УстановитьПараметр("ЭтотУзел20", ПланыОбмена.ОбменУчетВОСМДБухгалтерия20.ЭтотУзел());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.Организация КАК Организация,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
		|	РасчетыПоЛицевымСчетам.Услуга.ВидУслуги КАК ВидУслуги,
		|	РасчетыПоЛицевымСчетам.Сумма КАК Сумма,
		|	ЕСТЬNULL(ВложенныйЗапрос.Ссылка, ЗНАЧЕНИЕ(Документ.НачислениеДляБухгалтерии.ПустаяСсылка)) КАК Ссылка,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
		|	РасчетыПоЛицевымСчетам.ВидНачисления
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(НачислениеДляБухгалтерии.Ссылка) КАК Ссылка,
		|			НачислениеДляБухгалтерии.Организация КАК Организация,
		|			НачислениеДляБухгалтерии.ЛицевойСчет КАК ЛицевойСчет,
		|			НачислениеДляБухгалтерии.Здание КАК Здание
		|		ИЗ
		|			Документ.НачислениеДляБухгалтерии КАК НачислениеДляБухгалтерии
		|		ГДЕ
		|			НачислениеДляБухгалтерии.Дата >= &ДатаНач
		|			И НачислениеДляБухгалтерии.Дата <= &ДатаКон
		|			И НачислениеДляБухгалтерии.Организация = &Организация
		|			И НачислениеДляБухгалтерии.Здание = &Здание
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НачислениеДляБухгалтерии.Организация,
		|			НачислениеДляБухгалтерии.ЛицевойСчет,
		|			НачислениеДляБухгалтерии.Здание) КАК ВложенныйЗапрос
		|		ПО РасчетыПоЛицевымСчетам.Организация = ВложенныйЗапрос.Организация
		|			И РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец = ВложенныйЗапрос.Здание
		|			И РасчетыПоЛицевымСчетам.ЛицевойСчет = ВложенныйЗапрос.ЛицевойСчет
		|ГДЕ
		|	(РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РазовоеНачисление)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Перерасчет)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Пени))
		|	И РасчетыПоЛицевымСчетам.Организация = &Организация
		|	И РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец = &Здание
		|	И РасчетыПоЛицевымСчетам.Период >= &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Здание,
		|	ЛицевойСчетНаименование,
		|	ВидУслуги
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Организация,
		|	Здание,
		|	ЛицевойСчет,
		|	Ссылка,
		|	ВидУслуги";
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
    	ВыборкаЗдание = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗдание.Следующий() Цикл
	    	ВыборкаЛицевойСчет = ВыборкаЗдание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЛицевойСчет.Следующий() Цикл
		    	ВыборкаСсылка = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаСсылка.Следующий() Тогда
					Если ВыборкаСсылка.Ссылка = Документы.НачислениеДляБухгалтерии.ПустаяСсылка() Тогда
						ДокументОбъект = Документы.НачислениеДляБухгалтерии.СоздатьДокумент();
					Иначе	
						ДокументОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
						Если ДокументОбъект.ПометкаУдаления Тогда
							ДокументОбъект.УстановитьПометкуУдаления(Ложь);
						КонецЕсли; 
					КонецЕсли; 
					
					ДокументОбъект.Дата = ДатаДокумента;
					ДокументОбъект.Организация = ВыборкаСсылка.Организация;
					ДокументОбъект.Здание = ВыборкаСсылка.Здание;
					ДокументОбъект.ЛицевойСчет = ВыборкаСсылка.ЛицевойСчет;
					ДокументОбъект.ВидыУслуг.Очистить();
					
			    	ВыборкаВидУслуги = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаВидУслуги.Следующий() Цикл
//{{MRG[ <-> ]
			        	НоваяСтрока = ДокументОбъект.ВидыУслуг.Добавить();
//{{MRG[ <-> ]
				        НоваяСтрока.ВидУслуги = ВыборкаВидУслуги.ВидУслуги;
				        НоваяСтрока.Сумма = ВыборкаВидУслуги.Сумма;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//						Если ВыборкаВидУслуги.Сумма <>  0 Тогда
//							НоваяСтрока = ДокументОбъект.ВидыУслуг.Добавить();
//							НоваяСтрока.ВидУслуги = ВыборкаВидУслуги.ВидУслуги;
//					        НоваяСтрока.Сумма = ВыборкаВидУслуги.Сумма;
//						КонецЕсли;	
//}}MRG[ <-> ]
//				        Если ВыборкаВидУслуги.Сумма <>  0 Тогда
//							НоваяСтрока.ВидУслуги = ВыборкаВидУслуги.ВидУслуги;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//					        НоваяСтрока.Сумма = ВыборкаВидУслуги.Сумма;
//						КонецЕсли;	
//}}MRG[ <-> ]
					КонецЦикла;
					
					ДокументОбъект.Записать();
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла; 
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УдалитьНачислениеДляБухгалтерии(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеДляБухгалтерии.Ссылка
		|ИЗ
		|	Документ.НачислениеДляБухгалтерии КАК НачислениеДляБухгалтерии
		|ГДЕ
		|	НачислениеДляБухгалтерии.Дата >= &ДатаНач
		|	И НачислениеДляБухгалтерии.Дата <= &ДатаКон
		|	И НачислениеДляБухгалтерии.Организация = &Организация
		|	И НачислениеДляБухгалтерии.Здание = &Здание";
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	УчетКоммунальныхУслуг.УдалитьНачислениеПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	
КонецПроцедуры


Процедура СформироватьЛьготыСубсидииДляБухгалтерии(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	УчетКоммунальныхУслуг.СформироватьЛьготыСубсидииПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	
	ДатаДокумента = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата - 10;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменУчетВОСМДБухгалтерия.Ссылка,
	|	ОбменУчетВОСМДБухгалтерия.ДатаНачалаВыгрузкиДокументов
	|ИЗ
	|	ПланОбмена.ОбменУчетВОСМДБухгалтерия КАК ОбменУчетВОСМДБухгалтерия
	|ГДЕ
	|	ОбменУчетВОСМДБухгалтерия.ПометкаУдаления = ЛОЖЬ
	|	И ОбменУчетВОСМДБухгалтерия.ДатаНачалаВыгрузкиДокументов <= &ДатаНач
	|	И ОбменУчетВОСМДБухгалтерия.Ссылка <> &ЭтотУзел
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбменУчетВОСМДБухгалтерия20.Ссылка,
	|	ОбменУчетВОСМДБухгалтерия20.ДатаНачалаВыгрузкиДокументов
	|ИЗ
	|	ПланОбмена.ОбменУчетВОСМДБухгалтерия20 КАК ОбменУчетВОСМДБухгалтерия20
	|ГДЕ
	|	ОбменУчетВОСМДБухгалтерия20.ПометкаУдаления = ЛОЖЬ
	|	И ОбменУчетВОСМДБухгалтерия20.ДатаНачалаВыгрузкиДокументов <= &ДатаНач
	|	И ОбменУчетВОСМДБухгалтерия20.Ссылка <> &ЭтотУзел20";

	
	Запрос.УстановитьПараметр("ДатаНач", ДатаДокумента);
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменУчетВОСМДБухгалтерия.ЭтотУзел());
	Запрос.УстановитьПараметр("ЭтотУзел20", ПланыОбмена.ОбменУчетВОСМДБухгалтерия20.ЭтотУзел());

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.Организация КАК Организация,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец КАК Здание,
		|	-РасчетыПоЛицевымСчетам.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
		|			ТОГДА ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентСубсидия
		|		КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия)
		|			ТОГДА ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентРегиональнаяСубсидия
		|		ИНАЧЕ ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.КонтрагентЛьгота
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
		|			ТОГДА ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорСубсидия
		|		КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия)
		|			ТОГДА ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорРегиональнаяСубсидия
		|		ИНАЧЕ ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ДоговорЛьгота
		|	КОНЕЦ КАК ДоговорКонтрагента,
		|	ЕСТЬNULL(ВложенныйЗапрос.Ссылка, ЗНАЧЕНИЕ(Документ.ЛьготыСубсидииДляБухгалтерии.ПустаяСсылка)) КАК Ссылка,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЛьготыСубсидииДляБухгалтерии.Ссылка КАК Ссылка,
		|			ЛьготыСубсидииДляБухгалтерии.Организация КАК Организация,
		|			ЛьготыСубсидииДляБухгалтерии.Здание КАК Здание,
		|			ЛьготыСубсидииДляБухгалтерии.ЛицевойСчет КАК ЛицевойСчет,
		|			ЛьготыСубсидииДляБухгалтерии.Контрагент КАК Контрагент
		|		ИЗ
		|			Документ.ЛьготыСубсидииДляБухгалтерии КАК ЛьготыСубсидииДляБухгалтерии
		|		ГДЕ
		|			ЛьготыСубсидииДляБухгалтерии.Дата >= &ДатаНач
		|			И ЛьготыСубсидииДляБухгалтерии.Дата <= &ДатаКон
		|			И ЛьготыСубсидииДляБухгалтерии.Организация = &Организация
		|			И ЛьготыСубсидииДляБухгалтерии.Здание = &Здание) КАК ВложенныйЗапрос
		|		ПО РасчетыПоЛицевымСчетам.Организация = ВложенныйЗапрос.Организация
		|			И РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец = ВложенныйЗапрос.Здание
		|			И РасчетыПоЛицевымСчетам.ЛицевойСчет = ВложенныйЗапрос.ЛицевойСчет
		|			И (ВЫБОР
		|				КОГДА РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
		|					ТОГДА РасчетыПоЛицевымСчетам.Услуга.ВидУслуги.КонтрагентДляРасчетаПоСубсидиям = ВложенныйЗапрос.Контрагент
		|				ИНАЧЕ РасчетыПоЛицевымСчетам.Услуга.ВидУслуги.КонтрагентДляРасчетаПоЛьготам = ВложенныйЗапрос.Контрагент
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ТабличнаяКонтрагентовДляСубсидийИЛьгот КАК ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот
		|		ПО РасчетыПоЛицевымСчетам.Организация = ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.Ссылка
		|			И РасчетыПоЛицевымСчетам.Услуга.ВидУслуги = ОрганизацииТабличнаяКонтрагентовДляСубсидийИЛьгот.ВидУслуги
		|ГДЕ
		|	(РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
		|			ИЛИ РасчетыПоЛицевымСчетам.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.РегиональнаяСубсидия))
		|	И РасчетыПоЛицевымСчетам.Организация = &Организация
		|	И РасчетыПоЛицевымСчетам.ЛицевойСчет.Владелец = &Здание
		|	И РасчетыПоЛицевымСчетам.Период >= &ДатаНач
		|	И РасчетыПоЛицевымСчетам.Период <= &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Здание,
		|	ЛицевойСчетНаименование
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Организация,
		|	Здание,
		|	ЛицевойСчет,
		|	Контрагент,
		|	Ссылка,
		|	ДоговорКонтрагента";
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
    	ВыборкаЗдание = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗдание.Следующий() Цикл
	    	ВыборкаЛицевойСчет = ВыборкаЗдание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЛицевойСчет.Следующий() Цикл
		    	ВыборкаКонтрагент = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагент.Следующий() Цикл
			    	ВыборкаСсылка = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если ВыборкаСсылка.Следующий() Тогда
						Если ВыборкаСсылка.Ссылка = Документы.ЛьготыСубсидииДляБухгалтерии.ПустаяСсылка() Тогда
							ДокументОбъект = Документы.ЛьготыСубсидииДляБухгалтерии.СоздатьДокумент();
						Иначе	
							ДокументОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
							Если ДокументОбъект.ПометкаУдаления Тогда
								ДокументОбъект.УстановитьПометкуУдаления(Ложь);
							КонецЕсли; 
						КонецЕсли; 
						
						ДокументОбъект.Дата = ДатаДокумента;
						ДокументОбъект.Организация = ВыборкаСсылка.Организация;
						ДокументОбъект.Здание = ВыборкаСсылка.Здание;
						ДокументОбъект.ЛицевойСчет = ВыборкаСсылка.ЛицевойСчет;
						ДокументОбъект.Контрагент = ВыборкаСсылка.Контрагент;
						ДокументОбъект.СуммыДолга.Очистить();
						
				    	ВыборкаДоговор = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоговор.Следующий() Цикл
				        	НоваяСтрока = ДокументОбъект.СуммыДолга.Добавить();
					        НоваяСтрока.ДоговорКонтрагента = ВыборкаДоговор.ДоговорКонтрагента;
					        Если  ВыборкаДоговор.Сумма < 0 тогда
								НоваяСтрока.Сумма = -ВыборкаДоговор.Сумма;
								НоваяСтрока.ВидЗадолженности = Перечисления.ВидЗадолженностиДляБухгалтерии.Дебеторская;
								НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентовДляБухгалтерии.Покупатель;
							Иначе
								НоваяСтрока.Сумма = ВыборкаДоговор.Сумма;
								НоваяСтрока.ВидЗадолженности = Перечисления.ВидЗадолженностиДляБухгалтерии.Кредиторская;
								НоваяСтрока.ТипКонтрагента = Перечисления.СтатусыКонтрагентовДляБухгалтерии.Покупатель;
							КонецЕсли;
						КонецЦикла;
						
						ДокументОбъект.Записать();
						
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЛьготыСубсидииДляБухгалтерии(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛьготыСубсидииДляБухгалтерии.Ссылка
		|ИЗ
		|	Документ.ЛьготыСубсидииДляБухгалтерии КАК ЛьготыСубсидииДляБухгалтерии
		|ГДЕ
		|	ЛьготыСубсидииДляБухгалтерии.Дата >= &ДатаНач
		|	И ЛьготыСубсидииДляБухгалтерии.Дата <= &ДатаКон
		|	И ЛьготыСубсидииДляБухгалтерии.Организация = &Организация
		|	И ЛьготыСубсидииДляБухгалтерии.Здание = &Здание";
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	УчетКоммунальныхУслуг.УдалитьЛьготыСубсидииПодомовойУчет(ДокументСсылкаЗакрытиеЛицевогоСчета);
	
КонецПроцедуры

Процедура ПровестиСубсидии(ДокументСсылкаЗакрытиеЛицевогоСчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыПоСубсидиям.Организация,
		|	РасчетыПоСубсидиям.ЛицевойСчет,
		|	РасчетыПоСубсидиям.МесяцНачисления,
		|	РасчетыПоСубсидиям.Услуга,
		|	РасчетыПоСубсидиям.ГраницаСубсидии
		|ПОМЕСТИТЬ НачисленныеСубс
		|ИЗ
		|	РегистрНакопления.РасчетыПоСубсидиям КАК РасчетыПоСубсидиям
		|ГДЕ
		|	РасчетыПоСубсидиям.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|	И РасчетыПоСубсидиям.Организация = &Организация
		|	И РасчетыПоСубсидиям.ЛицевойСчет.Владелец = &Здание
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСубсидиям.Организация,
		|	РасчетыПоСубсидиям.ЛицевойСчет,
		|	РасчетыПоСубсидиям.Услуга,
		|	РасчетыПоСубсидиям.МесяцНачисления,
		|	РасчетыПоСубсидиям.ГраницаСубсидии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоСубсидиямОстатки.Организация,
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления КАК МесяцНачисления,
		|	СУММА(РасчетыПоСубсидиямОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	РасчетыПоСубсидиямОстатки.Услуга.ПолеСортировки КАК УслугаПолеСортировки,
		|	РасчетыПоСубсидиямОстатки.Услуга.ВидУслуги.ПолеСортировки КАК УслугаВидУслугиПолеСортировки,
		|	ЕСТЬNULL(НачисленныеСубс.ГраницаСубсидии, 0) КАК ГраницаСубсидии
		|ИЗ
		|	РегистрНакопления.РасчетыПоСубсидиям.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание
		|				И НАЧАЛОПЕРИОДА(МесяцНачисления, ДЕНЬ) < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)) КАК РасчетыПоСубсидиямОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленныеСубс КАК НачисленныеСубс
		|		ПО РасчетыПоСубсидиямОстатки.Организация = НачисленныеСубс.Организация
		|			И РасчетыПоСубсидиямОстатки.ЛицевойСчет = НачисленныеСубс.ЛицевойСчет
		|			И РасчетыПоСубсидиямОстатки.Услуга = НачисленныеСубс.Услуга
		|			И РасчетыПоСубсидиямОстатки.МесяцНачисления = НачисленныеСубс.МесяцНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.Услуга.ВидУслуги.ПолеСортировки,
		|	РасчетыПоСубсидиямОстатки.Услуга.ПолеСортировки,
		|	РасчетыПоСубсидиямОстатки.Организация,
		|	ЕСТЬNULL(НачисленныеСубс.ГраницаСубсидии, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцНачисления,
		|	УслугаВидУслугиПолеСортировки,
		|	УслугаПолеСортировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга,
		|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
		|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			НАЧАЛОПЕРИОДА(МесяцНачисления, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ДАТА, МЕСЯЦ)
		|				И Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание) КАК РасчетыПоЛицевымСчетамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет";
		
		
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	Запрос.УстановитьПараметр("Дата", ДокументСсылкаЗакрытиеЛицевогоСчета.Дата);

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаСубсидии =  РезультатЗапроса[1].Выгрузить();
	ТаблицаДолгов =  РезультатЗапроса[2].Выгрузить();
	
	
	ТаблицаРасчетыПоЛицевымСчетам = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Период");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("МесяцНачисления");
	//ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ВидНачсиления");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Сумма");
	
	
	ТаблицаРасчетыПоСубсидиям = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Период");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("МесяцНачисления");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Сумма");
	
	
	Для Каждого СтрокаТаблицаСубсидииУслуги Из ТаблицаСубсидии Цикл	
		СуммаОсталосьРаспределить = СтрокаТаблицаСубсидииУслуги.СуммаОстаток;
		
		ВыборкаДолги = ТаблицаДолгов.НайтиСтроки(Новый Структура("ЛицевойСчет, Услуга, МесяцНачисления", СтрокаТаблицаСубсидииУслуги.ЛицевойСчет, СтрокаТаблицаСубсидииУслуги.Услуга,НАЧАЛОМЕСЯЦА(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата)));
		
		Для каждого СтрокаВыборки Из ВыборкаДолги Цикл
			
			СуммаНачсиления = СтрокаВыборки.СуммаОстаток - СтрокаТаблицаСубсидииУслуги.ГраницаСубсидии;
			
			Если СуммаНачсиления <= 0 тогда
				Продолжить;
			КонецЕсли;
			
			
			
			Если СуммаНачсиления <= СтрокаТаблицаСубсидииУслуги.ГраницаСубсидии Тогда
				Продолжить;
			КонецЕсли;
			
			
			Если СуммаНачсиления <= СуммаОсталосьРаспределить  Тогда // сумма остатка меньше или равна чем осталось распределить
				
				Сумма = СуммаНачсиления;
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - СуммаНачсиления;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				Сумма =	СуммаОсталосьРаспределить;
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
			НоваяСтрока.Сумма = Сумма;
			
			НоваяСтрока = ТаблицаРасчетыПоСубсидиям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.МесяцНачисления = СтрокаТаблицаСубсидииУслуги.МесяцНачисления;
			НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
			НоваяСтрока.Сумма = Сумма;
			
			СтрокаВыборки.СуммаОстаток = СтрокаВыборки.СуммаОстаток - Сумма;
			
			Если СуммаОсталосьРаспределить = 0 Тогда
				Прервать; 
			КонецЕсли; 
		
		КонецЦикла; 
		
	КонецЦикла;	
	
	//Движения
	
	Если ТаблицаРасчетыПоЛицевымСчетам.Количество() > 0 Тогда
		
		НаборРасчеты = РегистрыНакопления.РасчетыПоЛицевымСчетам.СоздатьНаборЗаписей();
		НаборРасчеты.Отбор.Регистратор.Установить(ДокументСсылкаЗакрытиеЛицевогоСчета);
		НаборРасчеты.Прочитать();
		
		Для каждого Строка Из ТаблицаРасчетыПоЛицевымСчетам Цикл
			
			НоваяЗапись = НаборРасчеты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
			
			
		КонецЦикла; 
		
		
		НаборСубсидии = РегистрыНакопления.РасчетыПоСубсидиям.СоздатьНаборЗаписей();
		НаборСубсидии.Отбор.Регистратор.Установить(ДокументСсылкаЗакрытиеЛицевогоСчета);
		НаборСубсидии.Прочитать();
		
		Для каждого Строка Из ТаблицаРасчетыПоСубсидиям Цикл
			
			НоваяЗапись = НаборСубсидии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
			
			
		КонецЦикла;
		
		НаборРасчеты.Записать();
		НаборСубсидии.Записать();
	КонецЕсли;

	
	
КонецПроцедуры
